Revit 2027 API
BuiltInFailures.WallFailures.RemapConstrainLocationLine Property
 Existing locked constraints to the Location Line will be transferred to the new Location Line position. Press "Unconstrain" to remove the constraint rather than transferring it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RemapConstrainLocationLine { get; }
Public Shared ReadOnly Property RemapConstrainLocationLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RemapConstrainLocationLine {
	FailureDefinitionId^ get ();
}
static member RemapConstrainLocationLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace